data = {
        "20260601": "백미밥\n얼큰어묵국5.6.8.13\n청양크림함박스테이크1.2.5.6.10.13.16\n마파두부5.6.10.13\n부추겉절이5.6.13\n깍두기9.13&초코케잌1.2.5.6",
        "20260602": "미니후리가케밥4\n크림스프2.5.6.15.16\n육즙가득햄버거1.2.5.6.13.16\n오지치즈후라이2.5.6.10.12.13.16\n배추김치9.13\n에이드",
        "20260603": "지방선거일",
        "20260604": "모의고사",
        "20260605": "흑미밥\n두부된장국5.6.13\n오리불고기5.6.13\n옹심이만두조림2.5.6.8.10.13.16.18\n오이맛살초무침1.5.6.8.13\n배추김치9.13",
        
        "20260608": "백미밥\n북어무국5.6.13\n뉴진면봉추찜닭5.6.13.15\n해시브라운피자1.2.5.6.10.12.13\n청경채겉절이5.6.13\n배추김치9.13&떠먹는요플레2.11",
        "20260609": "백미밥\n노량진컵밥1.5.6.9.10.13.18\n미소장국5.6.13\n꿔바로우5.6.10.12.13\n무말랭이지9.13\n너를위한망고",
        "20260610": "흑미밥\n도토리묵냉국5.6.9.13\n마늘수육5.6.10.13\n짜파구리떡볶이1.2.5.6.8.9.10.13.15.16.17.18\n깍두기9.13\n미니크림치즈파이1.2.5.6",
        "20260611": "돈까스카레덮밥2.5.6.10.12.13.16.18\n우동국물1.2.5.6.8.9.13\n소시지구이&머스타드1.5.6.10.13.15.16\n만다린샐러드&오리엔탈5.6.13.18\n배추김치9.13\n청귤음료",
        "20260612": "잡곡밥5\n고기짬뽕2.5.6.9.10.15.16.17.18\n오리훈제야채볶음5.6.13\n동그랑땡전&케찹2.5.6.10.12.15.16\n명엽채볶음5.6.13\n배추김치9.13",
        
        "20260615": "잡곡밥5\n들깨미역국5.6.13\n매운돼지갈비찜5.6.10.13\n베이컨단호박크림뇨끼1.2.5.6.10.12.13.15.16\n진미고추장조림5.6.13.17\n배추김치9.13",
        "20260616": "김가루주먹밥4.5\n메밀국수3.5.6.13\n셀프불고기타코1.2.5.6.10.13.16\n비엔나조림5.6.10.12.13.15.16\n볶음김치5.9.13\n생일베리축하해파이1.2.5.6",
        "20260617": "굴소스야채볶음밥2.5.6.10.15.18\n파송송계란국1.5.6.13\n순대김말이강정2.5.6.10.12.13.16.18\n뿌링클감자버터구이2.5.6\n배추김치9.13\n복숭아에이드11",
        "20260618": "흑미밥\n돼지국밥5.6.10.13\n너비아니구이&파채2.5.6.10.12.15.16\n두부조림5.6.13\n콩나물당면무침5.6.13\n깍두기9.13",
        "20260619": "잡곡밥5\n닭개장5.6.13.15\n비배큐폭찹5.6.10.12.13.16\n한입꼬마핫도그5.6.10.12\n마늘쫑고추장무침5.6.13\n배추김치9.13&바나나",
        
        "20260622": "백미밥\n소고기탕국5.6.13.16\n닭묵은지찜5.6.9.13.15\n까르보나라떡볶이1.2.5.6.10.15.16\n치커리무침5.6.13\n깍두기9.13&피스타치오크림파이2.5.6",
        "20260623": "중화덮밥&계란후라이1.5.6.8.9.10.13.17.18\n팽이장국5.6.13\n순살돈까스2.5.6.10.13\n파스타샐러드2.5.6.13.18\n배추김치9.13",
        "20260624": "백미밥\n푸팟퐁커리1.2.5.6.12.16.18\n숯불맛닭윙봉조림5.6.12.13.15.16.18\n유부맛살겨자냉채1.5.6.8.13\n배추김치9.13\n리치에이드",
        "20260625": "백미밥\n고추참치덮밥5.6.12.13\n들깨무채국5.6.13\n오징어튀김&치폴레마요1.2.5.6.12.15.16.17.18\n어묵채볶음5.6.8.13\n배추김치9.13&과일맛푸딩",
        "20260626": "흑미밥\n단배추된장국5.6.13\n콘치즈불닭1.2.5.6.13.15\n청양마요타코야끼1.5.6.13.16\n도토리묵무침5.6.13\n배추김치9.13&마시는요거트2",
        
        "20260629": "백미밥\n소고기미역국5.6.13.16\n할라피뇨치즈볼카츠&소스1.2.5.6.10.12.13.15\n우동볶이5.6.10.13\n하얀콩나물무침5.6.13\n배추김치9.13"
    }

data_tuples = list(data.items())

import sqlite3

conn = sqlite3.connect("/workspaces/DaegunDinnerAPI/dinner.db")
cur = conn.cursor()
sql = "INSERT INTO dinner (date, menu) VALUES (?, ?)"
cur.executemany(sql, data_tuples)
conn.commit()
conn.close()