data = {
    "20260601": "백미밥\n얼큰어묵국 (5.6.8.13)\n청양크림함박스테이크 (1.2.5.6.10.13.16)\n마파두부 (5.6.10.13)\n부추겉절이 (5.6.13)\n깍두기 (9.13) & 초코케잌 (1.2.5.6)",
    "20260602": "미니후리가케밥 (4)\n크림스프 (2.5.6.15.16)\n육즙가득햄버거 (1.2.5.6.13.16)\n오지치즈후라이 (2.5.6.10.12.13.16)\n배추김치 (9.13)\n에이드",
    "20260603": "지방선거일",
    "20260604": "모의고사",
    "20260605": "흑미밥\n두부된장국 (5.6.13)\n오리불고기 (5.6.13)\n옹심이만두조림 (2.5.6.8.10.13.16.18)\n오이맛살초무침 (1.5.6.8.13)\n배추김치 (9.13)",
    
    "20260608": "백미밥\n북어무국 (5.6.13)\n뉴진면봉추찜닭 (5.6.13.15)\n해시브라운피자 (1.2.5.6.10.12.13)\n청경채겉절이 (5.6.13)\n배추김치 (9.13) & 떠먹는요플레 (2.11)",
    "20260609": "백미밥\n노량진컵밥 (1.5.6.9.10.13.18)\n미소장국 (5.6.13)\n꿔바로우 (5.6.10.12.13)\n무말랭이지 (9.13)\n너를위한망고",
    "20260610": "흑미밥\n도토리묵냉국 (5.6.9.13)\n마늘수육 (5.6.10.13)\n짜파구리떡볶이 (1.2.5.6.8.9.10.13.15.16.17.18)\n깍두기 (9.13)\n미니크림치즈파이 (1.2.5.6)",
    "20260611": "돈까스카레덮밥 (2.5.6.10.12.13.16.18)\n우동국물 (1.2.5.6.8.9.13)\n소시지구이&머스타드 (1.5.6.10.13.15.16)\n만다린샐러드&오리엔탈 (5.6.13.18)\n배추김치 (9.13)\n청귤음료",
    "20260612": "잡곡밥 (5)\n고기짬뽕 (2.5.6.9.10.15.16.17.18)\n오리훈제야채볶음 (5.6.13)\n동그랑땡전&케찹 (2.5.6.10.12.15.16)\n명엽채볶음 (5.6.13)\n배추김치 (9.13)",
    
    "20260615": "잡곡밥 (5)\n들깨미역국 (5.6.13)\n매운돼지갈비찜 (5.6.10.13)\n베이컨단호박크림뇨끼 (1.2.5.6.10.12.13.15.16)\n진미고추장조림 (5.6.13.17)\n배추김치 (9.13)",
    "20260616": "김가루주먹밥 (4.5)\n메밀국수 (3.5.6.13)\n셀프불고기타코 (1.2.5.6.10.13.16)\n비엔나조림 (5.6.10.12.13.15.16)\n볶음김치 (5.9.13)\n생일베리축하해파이 (1.2.5.6)",
    "20260617": "굴소스야채볶음밥 (2.5.6.10.15.18)\n파송송계란국 (1.5.6.13)\n순대김말이강정 (2.5.6.10.12.13.16.18)\n뿌링클감자버터구이 (2.5.6)\n배추김치 (9.13)\n복숭아에이드 (11)",
    "20260618": "흑미밥\n돼지국밥 (5.6.10.13)\n너비아니구이&파채 (2.5.6.10.12.15.16)\n두부조림 (5.6.13)\n콩나물당면무침 (5.6.13)\n깍두기 (9.13)",
    "20260619": "잡곡밥 (5)\n닭개장 (5.6.13.15)\n바베큐폭찹 (5.6.10.12.13.16)\n한입꼬마핫도그 (5.6.10.12)\n마늘쫑고추장무침 (5.6.13)\n배추김치 (9.13) & 바나나",
    
    "20260622": "백미밥\n소고기탕국 (5.6.13.16)\n닭묵은지찜 (5.6.9.13.15)\n까르보나라떡볶이 (1.2.5.6.10.15.16)\n치커리무침 (5.6.13)\n깍두기 (9.13) & 피스타치오크림파이 (2.5.6)",
    "20260623": "중화덮밥&계란후라이 (1.5.6.8.9.10.13.17.18)\n팽이장국 (5.6.13)\n순살돈까스 (2.5.6.10.13)\n파스타샐러드 (2.5.6.13.18)\n배추김치 (9.13)",
    "20260624": "백미밥\n푸팟퐁커리 (1.2.5.6.12.16.18)\n숯불맛닭윙봉조림 (5.6.12.13.15.16.18)\n유부맛살겨자냉채 (1.5.6.8.13)\n배추김치 (9.13)\n리치에이드",
    "20260625": "백미밥\n고추참치덮밥 (5.6.12.13)\n들깨무채국 (5.6.13)\n오징어튀김&치폴레마요 (1.2.5.6.12.15.16.17.18)\n어묵채볶음 (5.6.8.13)\n배추김치 (9.13) & 과일맛푸딩",
    "20260626": "흑미밥\n단배추된장국 (5.6.13)\n콘치즈불닭 (1.2.5.6.13.15)\n청양마요타코야끼 (1.5.6.13.16)\n도토리묵무침 (5.6.13)\n배추김치 (9.13) & 마시는요거트 (2)",
    
    "20260629": "백미밥\n소고기미역국 (5.6.13.16)\n할라피뇨치즈볼카츠&소스 (1.2.5.6.10.12.13.15)\n우동볶이 (5.6.10.13)\n하얀콩나물무침 (5.6.13)\n배추김치 (9.13)"
}

data_tuples = list(data.items())

import sqlite3

conn = sqlite3.connect("/workspaces/DaegunDinnerAPI/dinner.db")
cur = conn.cursor()
sql = "INSERT INTO dinner (date, menu) VALUES (?, ?)"
cur.executemany(sql, data_tuples)
conn.commit()
conn.close()